{
    "locale-switcher-english": "Inglés",
    "locale-switcher-spanish": "Español",
    "app-home": "Inicio",
    "app-about": "Acerca de",
    "about-title": "Esta es la 'Shopping List Kata' (La lista de la compra)",
    "app-about-content-line-1":"Necesitamos una web app para gestionar una lista de items. Los requisitos son: ",    
    "app-about-content-line-2":"Un elemento tiene un nombre que empieza por A-Z o a-z o un número, pero no tiene espacios antes del primer carácter",     
    "app-about-content-line-3": "El usuario puede añadir un elemento",   
    "app-about-content-line-4": "El usuario puede eliminar un elemento",
    "app-about-content-line-5": "El usuario puede modificar el nombre de un elemento",
    "app-about-content-line-6": "La cantidad de un elemento comprado debe ser mostrada",
    "app-about-content-line-7": "El usuario puede eliminar todos los elementos, pero este debería ser advertido de esta acción",    
    "app-about-content-line-8": "El interfaz de usuario debe permitir al usuario hacer estas acciones. Algunas recomendaciones:",    
    "app-about-content-line-9": "Un botón para cada acción es una buena opción para el usuario. Este podría estar interesado en tener un botón en el propio item para eliminar y actualizar",    
    "app-about-content-line-10": "Un campo de texto para el nombre del elemento podría ser una buena opción para el usuario cuando está añadiendo un nuevo item",    
    "app-about-content-line-11": "No más de 10 items deberían ser presentados en la pantalla a la vez",    
    "app-about-content-line-12": "El nombre y la cantidad en formato tabular podría ser una buena opción de visualización para el usuario",    
    "app-about-content-line-13": "Deberían mostrarse validaciones para los campos de texto. Por ejemplo un pequeño mensaje debajo del campo de entrada de texto" ,    
    "app-about-content-line-14": "Cada usuario deberia tener su propia lista de la compra, y no debería ver la lista de otros usuarios",    
    "shopping-list-please-write-the-name":"Por favor, introduce el nombre del elemento:",
    "shopping-list-add-item":"añade elemento",
    "shopping-list-delete-all":"borra todo",
    "shopping-list-item": "Elemento",
    "shopping-list-quantity": "Cantidad",
    "shopping-list-action": "Acción",
    "shopping-list-delete-all-message": "Vas a borrar todos los elementos. ¿quieres continuar?",
    "shopping-list-your-shopping-list": "Tu lista de la compra",
    "shopping-list-for-example": "Por ejemplo: Jamón Serrano",
    "question-accept": "Aceptar",
    "question-cancel": "Cancelar",
    "shopping-list-you-are-going-to-remove-one-item": "Vas a eliminar el elemento '%s'. ¿Quieres continuar?"
}